app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "1st onehere"], ["user_id", 2], ["created_at", "2017-03-28 22:25:18.902764"], ["updated_at", "2017-03-28 22:25:18.902764"]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "this is a 2nd pin"], ["updated_at", "2017-03-28 20:59:47.016399"], ["id", 2]]